<?php
/**
 * Created by PhpStorm.
 * User: Administrator
 * Date: 2019/11/10 0010
 * Time: 21:17
 */

return [

    /*
    |--------------------------------------------------------------------------
    | customized http code
    |--------------------------------------------------------------------------
    |
    | The first number is error type, the second and third number is
    | product type, and it is a specific error code from fourth to
    | sixth.But the success is different.
    |
    */

    'code' => [
        200 => '成功',
        900009 => '无数据',
        //token
        401 => '登录token过期',

        //短信模块
        200001 => '短信发送失败',
        200002 => '验证码错误',

        //会员模块
        210001 => '注册失败',
        210002 => '手机号已存在',
        210003 => '登录失败',
        210005 => '绑定微信失败',
        210006 => '绑定手机号失败',
        210007 => '修改手机号失败',
        210008 => '找回密码失败',
        210009 => '修改密码失败',
        210010 => '修改头像失败',
        210011 => '修改会员信息失败',
        210012 => '该用户已被推荐',
        210013 => '实名认证失败',
        210015 => '实名已认证，无需重复认证',
        210016 => '头像更新失败',
        210017 => '设置金额失败',
        210018 => '用户提交反馈失败',
        210019 => '积分转换不得低于10积分',
        210020 => '积分转换失败',
        210021 => '提现金额必须为10的整数倍',
        210022 => '申请提现失败',
        210023 => '零钱余额不足',
        210025 => '微信解绑失败',
        210026 => '两次密码不一致',
        210027 => '黑金卡升级信息修改失败',
        210028 => '请重新获取微信openid',
        210029 => '获取微信openid失败',
        210030 => '请绑定手机号',
        210031 => '领取礼包失败',
        210032 => '反馈图片提交失败',
        210035 => '该手机号已注册',
        210036 => '消息读取失败',

        //店铺模块
        300001 => '您还不是商家，无权添加',
        300002 => '店员添加失败',
        300003 => '该店员已添加',
        300005 => '删除店员失败',
        300006 => '店铺收藏失败',
        300007 => '商家入驻失败',
        300008 => '店铺信息修改失败',
        300009 => '取消店铺收藏失败',

        //银行卡模块
        500001 => '银行卡绑定失败',
        500002 => '该银行卡号已绑定，无需重复绑定',

        //文件模块
        600001 => '最多可上传9张图片',
        600002 => '图片后缀名不合法',
        600003 => '图片超过最大限制',
        600005 => '请选择文件',
        600006 => '图片上传失败',

        //商品模块
        700001 => '商品收藏失败',
        700002 => '新增商品规格失败',
        700003 => '新增商品SKU失败',
        700005 => '新增商品失败',
        700006 => '商品删除失败',
        700007 => '商品购物车添加失败',
        700008 => '商品购物车移除失败',
        700009 => '已无商品数量，不能再减少',
        700010 => '取消商品收藏失败',
        700011 => '无权限下架该商品',
        700012 => '该商品下架失败',
        700013 => '该商品上架失败',

        //订单模块
        800001 => '非法订单',
        800002 => '未知的支付方式',
        800003 => '订单已支付',
        800005 => '支付失败',
        800006 => '取消订单失败',
        800007 => '订单评价失败',
        800008 => '支付金额不能为空',
        800009 => '支付密码错误',
        800010 => '该订单未支付，不能确认消费',
        800011 => '该订单确认消费失败',
        800012 => '创建订单失败',
        800013 => '该订单未支付，不能评价',
    ],

];
